SOAP_fahrenheit_to_celsius_conversion/imported_from_collection.http

#!/usr/bin/env dothttp

// Converts fahrenheit temperature to celsius.

@name("Fahrenheit to Celsius Conversion")
POST "https://www.w3schools.com/xml/tempconvert.asmx"
"Content-Type": "text/xml"
data('<soap12:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap12="http://www.w3.org/2003/05/soap-envelope">
  <soap12:Body>
    <FahrenheitToCelsius xmlns="https://www.w3schools.com/xml/">
      <Fahrenheit>75</Fahrenheit>
    </FahrenheitToCelsius>
  </soap12:Body>
</soap12:Envelope>')



